stress-test 2/stress_test.yaml
# 用来测试服务器乘载的压力测试脚本
# 本脚本需要使用 artillery 来运行

config:
  target: 'https://ao-dev.xiongmaopeilian.com'
  socketio:
    transports: ["websocket"]
    path: '/xyz'
    query:
      ssid: '1' # 使用哪一台服务器
  phases:
    # 一共 40 秒，每秒增加 25 个用户
    - duration: 10
      arrivalRate: 50
  variables:
  processor: './functions.js'
scenarios:
  - name: 'stress test'
    engine: 'socketio'
    flow:
      # 验证身份
      - function: 'setUser'
      - log: '-- {{uid}} start auth'
      - emit:
          channel: 'authenticate'
          data: {uid: '{{uid}}', token: '{{uid}}'}
          response:
            channel: 'authenticate'
            match:
              json: '$.status'
              value: 0
      # 加入房间
      - function: 'setRoom'
      - log: '-- {{uid}} join room {{room}}'
      - emit:
          channel: 'join'
          data: {roomId: '{{ room }}'}
          response:
            channel: 'join'
            match:
              json: '$.status'
              value: 0
      # 发送消息
      - log: '-- {{uid}} begin send msg'
      - think: 2 # 等待 2 秒，让另一个用户加入房间
      - loop:
          - log: 'user {{uid}} send msg for the {{ $loopCount }} time'
          - function: 'sendRandCountMsg' # 发送随机数量的消息
          - think: '{{ $randomNumber(1, 3) }}'
        count: 100